Test/bin/Debug/0.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Header><AMA_SecurityHostedUser xmlns="http://xml.amadeus.com/2010/06/Security_v1"><UserID POS_Type="1" PseudoCityCode="MOWR228SG" AgentDutyCode="SU" RequestorType="U" /></AMA_SecurityHostedUser><wsse:Security soap:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:UsernameToken><wsse:Username>WSS7TS7T</wsse:Username><wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">anq58WW7lfScQnWamZMKPmr0Az4=</wsse:Password><wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">ungbcO8vuE6Oal6iKULSwA==</wsse:Nonce><wsu:Created>2019-10-17T10:57:02Z</wsu:Created></wsse:UsernameToken></wsse:Security><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:67ddc05d-767d-43f9-99e6-b906fca0a3e7</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">https://noded1.test.webservices.amadeus.com/1ASIWS7TS7T</To><Action xmlns="http://www.w3.org/2005/08/addressing">http://webservices.amadeus.com/FMPTBQ_14_3_1A</Action></soap:Header><soap:Body><Fare_MasterPricerTravelBoardSearch xmlns="http://xml.amadeus.com/FMPTBQ_14_3_1A"><numberOfUnit><unitNumberDetail><numberOfUnits>1</numberOfUnits><typeOfUnit>PX</typeOfUnit></unitNumberDetail><unitNumberDetail><numberOfUnits>200</numberOfUnits><typeOfUnit>RC</typeOfUnit></unitNumberDetail></numberOfUnit><paxReference><ptc>ADT</ptc><traveller><ref>1</ref></traveller></paxReference><fareOptions><pricingTickInfo><pricingTicketing><priceType>RU</priceType><priceType>ET</priceType><priceType>NSD</priceType><priceType>TAC</priceType><priceType>RP</priceType></pricingTicketing></pricingTickInfo></fareOptions><travelFlightInfo><cabinId><cabin>Y</cabin></cabinId><companyIdentity><carrierQualifier>M</carrierQualifier><carrierId>SU</carrierId></companyIdentity></travelFlightInfo><itinerary><requestedSegmentRef><segRef>1</segRef></requestedSegmentRef><departureLocalization><departurePoint><locationId>MOW</locationId></departurePoint></departureLocalization><arrivalLocalization><arrivalPointDetails><locationId>OVB</locationId></arrivalPointDetails></arrivalLocalization><timeDetails><firstDateTimeDetail><date>081219</date></firstDateTimeDetail></timeDetails><flightInfo><unitNumberDetail><numberOfUnits>1</numberOfUnits><typeOfUnit>C</typeOfUnit></unitNumberDetail></flightInfo></itinerary></Fare_MasterPricerTravelBoardSearch></soap:Body></soap:Envelope>